<h3>Reading the datasets and checking the common columns<h3>

In [144]:
import pandas as pd


file_path_0 = 'C:\\Users\\ReDI\\Desktop\\KreativStorm\\Datasets\\NSSAL_2000.dta'
file_path_10 = 'C:\\Users\\ReDI\\Desktop\\KreativStorm\\Datasets\\NSSAL_2010.dta'


df_1 = pd.read_stata(file_path_0)
df_2 = pd.read_stata(file_path_10)

<h3>transform the column "hetlife" to numerical<h3>

In [145]:
# Convert the "hetlife" column to numeric data type
df_1['hetlife'] = pd.to_numeric(df_1['hetlife'], errors='coerce')
df_2['hetlife'] = pd.to_numeric(df_2['hetlife'], errors='coerce')

# errors='coerce' will convert any non-numeric values to NaN (missing values)


print(df_1['hetlife'].dtype)
print(df_2['hetlife'].dtype)

float64
float64

<h3>make copies of the new dataset<h3>

In [146]:
df1_float = df_1.copy()
df2_float = df_2.copy()

<h3>Create 2 new datasets, picking only the columns that we need<h3>

In [147]:
columns_to_keep = ['hetlife', 'rsex', 'dateyoi']


new_df_1 = df1_float[columns_to_keep]
new_df_2 = df2_float[columns_to_keep]

<h3>Merging the datasets<h3>

In [148]:
# merging 2 datasets
merged_df = pd.merge(new_df_1, new_df_2, how='outer')


# Save the merged dataset to a new CSV file
merged_df.to_csv('df.csv', index=False)

In [149]:
df

       hetlife    rsex  dateyoi
12110      1.0    male     2010
12111      1.0  female     2010
12112      3.0    male     2010
12113     17.0  female     2010
12114      3.0  female     2010
...        ...     ...      ...
27267      0.0    male     2012
27268      1.0  female     2012
27269      3.0    male     2012
27270     20.0  female     2012
27271      1.0  female     2012

[15162 rows x 3 columns]

<h3> convert the values in a column to lowercase for rsex<h3>

In [150]:
# Specify the column containing 'Male' and 'Female' values
column_name = 'rsex'

# Convert values to lowercase
df[column_name] = df[column_name].str.lower()

# Print the unique values in the column to verify the change
print(df[column_name].unique())

['male' 'female']

C:\Users\ReDI\AppData\Local\Temp\ipykernel_14140\1291767879.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[column_name] = df[column_name].str.lower()

<h3>Make a copy of the final dataset<h3>

In [151]:
final_df = df.copy()

In [152]:
final_df

       hetlife    rsex  dateyoi
12110      1.0    male     2010
12111      1.0  female     2010
12112      3.0    male     2010
12113     17.0  female     2010
12114      3.0  female     2010
...        ...     ...      ...
27267      0.0    male     2012
27268      1.0  female     2012
27269      3.0    male     2012
27270     20.0  female     2012
27271      1.0  female     2012

[15162 rows x 3 columns]

<h3>Infos on HetLife and transformation of datatype<h3>

In [153]:
# min and max of column: hetlife

import pandas as pd


column_name_hetlife = 'hetlife'


min_value_of_hetlife = final_df[column_name_hetlife].min()
max_value_of_hetlife = final_df[column_name_hetlife].max()

print("Minimum value of column {}: {}".format(column_name_hetlife, min_value_of_hetlife))
print("Maximum value of column {}: {}".format(column_name_hetlife, max_value_of_hetlife))

Minimum value of column hetlife: 0.0
Maximum value of column hetlife: 3300.0

In [154]:
# Showing values for hetlife

print(final_df['hetlife'])

12110     1.0
12111     1.0
12112     3.0
12113    17.0
12114     3.0
         ...
27267     0.0
27268     1.0
27269     3.0
27270    20.0
27271     1.0
Name: hetlife, Length: 15162, dtype: float64

<h3>check the data types for the final dataset<h3>

In [155]:
# check the data types for the final dataset

import pandas as pd

# Check the data types of all columns
print(final_df.dtypes)

hetlife    float64
rsex        object
dateyoi      int64
dtype: object

<h3>descriptive analysis for the final df<h3>

In [156]:
# Descriptive Analysis:


# Group by gender and dateyoi, then compute summary statistics
summary_stats = final_df.groupby(['rsex', 'dateyoi'])['hetlife'].agg(['mean', 'median', 'std', 'min', 'max'])

print(summary_stats)

                     mean  median        std  min     max
rsex   dateyoi
female 2010      7.265902     4.0  10.300151  0.0   150.0
       2011      7.943318     4.0  39.983265  0.0  2220.0
       2012      7.170845     4.0  14.282854  0.0   500.0
male   2010     16.988235     5.0  96.404400  0.0  2200.0
       2011     14.247217     5.0  80.838608  0.0  3300.0
       2012     13.313426     5.0  34.038149  0.0  1000.0

In [157]:
print(final_df['hetlife'].min())
print(final_df['hetlife'].max())

0.0
3300.0

In [158]:
sort_column = 'hetlife'

# Sort the DataFrame in descending order based on the specified column
sorted_df = final_df.sort_values(by=sort_column, ascending=False)

# Display the first and last 20 rows
print("First 20 rows:")
print(sorted_df.head(20))  
print("\nLast 20 rows:")
print(sorted_df.tail(20))

First 20 rows:
       hetlife    rsex  dateyoi
15509   3300.0    male     2011
21285   2500.0    male     2011
26725   2220.0  female     2011
13513   2200.0    male     2010
14434   1115.0  female     2011
12840   1000.0    male     2010
17769   1000.0    male     2012
19854    999.0    male     2011
18082    500.0  female     2012
25102    500.0    male     2011
19073    500.0    male     2012
26094    450.0  female     2011
24044    401.0    male     2011
14138    400.0    male     2011
23983    400.0    male     2011
12762    400.0    male     2010
12279    400.0    male     2010
17900    350.0    male     2012
25036    301.0  female     2011
20081    300.0  female     2011

Last 20 rows:
       hetlife    rsex  dateyoi
26923      NaN    male     2011
26990      NaN  female     2011
27008      NaN    male     2011
27017      NaN  female     2011
27074      NaN    male     2011
27104      NaN  female     2011
27157      NaN    male     2012
27158      NaN    male     2012
27167      NaN  female     2012
27179      NaN    male     2012
27182      NaN    male     2012
27197      NaN    male     2012
27199      NaN    male     2012
27205      NaN    male     2012
27207      NaN  female     2012
27209      NaN  female     2012
27211      NaN  female     2012
27252      NaN  female     2012
27257      NaN  female     2012
27263      NaN    male     2012

<h3>check the NaN values for the final dataset<h3>

In [159]:
# as we can see there some NaN values, let's check them out

# Check for NaN values in the specified column
nan_values_hetlife = final_df['hetlife'].isna()  # or df[column_name].isnull()

# Count the number of NaN values
nan_count_hetlife = nan_values_hetlife.sum()

print("Number of NaN values in column: ", nan_count_hetlife)

Number of NaN values in column:  604

<h2>handling NaN values<h2>


<h4> Drop rows with NaN values in 'hetlife' column
<h4>

In [160]:
# Dropping missing values

clean_df = final_df.dropna()

In [161]:
# as we can see there some NaN values, let's check them out

# Check for NaN values in the specified column
nan_values_hetlife_1 = clean_df['hetlife'].isna()  

# Count the number of NaN values
nan_count_hetlife = nan_values_hetlife_1.sum()

print("Number of NaN values in column: ", nan_count_hetlife)

Number of NaN values in column:  0

<h3>Visualization:

Create visualizations such as histograms to visually compare the distribution of the number of heterosexual partners between genders for each time period.<h3>

In [162]:
print(clean_df['hetlife'].dtype)

float64

In [163]:
import pandas as pd


clean_df.to_csv('clean_df.csv', index=False)

In [164]:
clean_df

       hetlife    rsex  dateyoi
12110      1.0    male     2010
12111      1.0  female     2010
12112      3.0    male     2010
12113     17.0  female     2010
12114      3.0  female     2010
...        ...     ...      ...
27267      0.0    male     2012
27268      1.0  female     2012
27269      3.0    male     2012
27270     20.0  female     2012
27271      1.0  female     2012

[14558 rows x 3 columns]